read_lef "/home/oreheem/shared/ispd19_test9/ispd19_test9.input.lef"
read_def "/home/oreheem/shared/ispd19_test9/ispd19_test9.input.def"

set seed 1
set_global_routing_layer_adjustment * 0.5
set_global_routing_random -seed $seed
set_routing_layers -signal Metal1-Metal9

global_route -guide_file  "/home/oreheem/shared/fr_results/out_seed_$seed.guide"

exit
